user_tutorial/thermFluidOptFoam/Reference_thermFluid_bend_90deg/constant/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}

k_fluid        k_fluid [1  1 -3 -1 0 0 0] 0.1056;           // Fluid thermal conductivity
rho_fluid    rho_fluid [1 -3  0  0 0 0 0] 865.0;    		// Fluid density
cp_fluid      cp_fluid [0  2 -2 -1 0 0 0] 1670.0;    		// Fluid specific heat capacity

k_solid        k_solid [1  1 -3 -1 0 0 0] 193.0;            // Solid thermal conductivity
rho_solid    rho_solid [1 -3  0  0 0 0 0] 2780.0;   		// Solid density
cp_solid      cp_solid [0  2 -2 -1 0 0 0] 875.0;    		// Solid specific heat capacity

Q            		 Q [1 -1 -3  0 0 0 0] -6.0e07;          // Heat generation [W/m^3]
T_min            T_min [0  0  0  1 0 0 0] 293.15;           // Minimum temperature of domain
